Revit 2024 API
AreaTag Class
Provides access to the area topology in Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AreaTag : SpatialElementTag
Visual Basic
Public Class AreaTag _
	Inherits SpatialElementTag
Visual C++
public ref class AreaTag : public SpatialElementTag
Remarks
The areaTag object can be queried for its boundary for use in space planning tools.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElementTag
 Autodesk.Revit.DB.AreaTag
See Also
AreaTag Members
Autodesk.Revit.DB Namespace